#Использовать gui

Перем ФормаПользователя;

//# Обработка события первого открытия формы
Процедура ПриОткрытииФормы() Экспорт
	
	ПолеЛогин = ФормаПользователя.Элементы.Добавить("ПолеЛогин", "ПолеФормы", Неопределено);
	ПолеЛогин.Вид = ФормаПользователя.ВидПоляФормы.ПолеВвода;
	ПолеЛогин.Заголовок = "Логин:";
	ПолеЛогин.Значение = "";
	
	ПолеПароль = ФормаПользователя.Элементы.Добавить("ПолеПароль", "ПолеФормы", Неопределено);
	ПолеПароль.Вид = ФормаПользователя.ВидПоляФормы.ПолеВвода;
	ПолеПароль.Заголовок = "Пароль:";
	ПолеПароль.Значение = "";
	
	КнопкаВхода = ФормаПользователя.Элементы.Добавить("КнопкаВхода", "КнопкаФормы", Неопределено);
	КнопкаВхода.Заголовок = "Login";
	КнопкаВхода.УстановитьДействие(ЭтотОбъект, "Нажатие", "ПриНажатииНаКнопкуВхода");
КонецПроцедуры



Процедура ПриНажатииНаКнопкуВхода() Экспорт
	ФормаПользователя.Элементы.Найти("ПолеПароль").Значение = "Неверный пароль";
КонецПроцедуры

УправляемыйИнтерфейс = Новый УправляемыйИнтерфейс();
ФормаПользователя = УправляемыйИнтерфейс.СоздатьФорму();

ФормаПользователя.УстановитьДействие(ЭтотОбъект, "ПриОткрытии", "ПриОткрытииФормы");
ФормаПользователя.Показать();