#Использовать gui
#Использовать notify

Перем ФормаПользователя;
Перем Диалоги;
Перем УправляемыйИнтерфейс;
Перем ВходВСистему;
Перем МассивНаУдаление;
Перем ОписаниеОповещения;
Перем ВидыПоляФормы;
Перем Логин;


//# Обработка события первого открытия формы
Процедура ПриОткрытииФормы() Экспорт
	ВходВСистему = Ложь;
	ВидыПоляФормы = ФормаПользователя.ВидГруппыФормы;
	
	ПолеЛогин = ФормаПользователя.Элементы.Добавить("ПолеЛогин", "ПолеФормы", Неопределено);
	ПолеЛогин.Вид = ФормаПользователя.ВидПоляФормы.ПолеВвода;
	ПолеЛогин.Заголовок = "Логин:";
	ПолеЛогин.Значение = "";
	
	ПолеПароль = ФормаПользователя.Элементы.Добавить("ПолеПароль", "ПолеФормы", Неопределено);
	ПолеПароль.Вид = ФормаПользователя.ВидПоляФормы.ПолеВвода;
	ПолеПароль.Заголовок = "Пароль:";
	ПолеПароль.Значение = "";
	
	
	ГруппаПолей = ФормаПользователя.Элементы.Добавить("ГруппаПолей", "ГруппаФормы", Неопределено);
	ГруппаПолей.Вид = ВидыПоляФормы.ОбычнаяГруппа;
	
	ФормаПользователя.Элементы.Переместить(ПолеЛогин, ГруппаПолей, Неопределено);
	ФормаПользователя.Элементы.Переместить(ПолеПароль, ГруппаПолей, Неопределено);
	
	
	КнопкаВхода = ФормаПользователя.Элементы.Добавить("КнопкаВхода", "КнопкаФормы", Неопределено);
	КнопкаВхода.Заголовок = "Login";
	КнопкаВхода.Закрепление = УправляемыйИнтерфейс.СтильЗакрепления.Право;
	КнопкаВхода.УстановитьДействие(ЭтотОбъект, "Нажатие", "ПриНажатииНаКнопкуВхода");
КонецПроцедуры

Процедура ПриНажатииНаКнопкуВхода() Экспорт
	Ответ = Диалоги.Вопрос("Войти в систему?", РежимДиалогаВопрос.ДаНет, ,
			КодВозвратаДиалога.Нет, "Вход в систему", КодВозвратаДиалога.Нет);
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ОчиститьФорму(ФормаПользователя);
	КонецЕсли;
КонецПроцедуры

Процедура ОчиститьФорму(Форма)
	ГруппаПолей = Форма.Элементы.Найти("ГруппаПолей");
	ПолеЛогина = ГруппаПолей.Элементы.Найти("ПолеЛогин").Значение;
	Логин = ПолеЛогина;
	ПолеПароля = ГруппаПолей.Элементы.Найти("ПолеПароль").Значение;
	
	Если ЗначениеЗаполнено(ПолеЛогина) И ЗначениеЗаполнено(ПолеПароля) Тогда
		ВходВСистему = Истина;
	Иначе
		Диалоги.Предупреждение("Должны быть заполнены все поля!");
		Возврат;
	КонецЕсли;
	МассивНаУдаление = Новый Массив;
	Для Каждого ЭлементФ Из Форма.Элементы Цикл
		МассивНаУдаление.Добавить(ЭлементФ.Имя);
	КонецЦикла;
	
	ОписанияОповещений.ВыполнитьОбработкуОповещения(ОписаниеОповещения);
КонецПроцедуры

Процедура ОбработкаОчистки()
	Для Каждого ЭлементФ Из МассивНаУдаление Цикл
		ТекущееПоле = ФормаПользователя.Элементы.Найти(ЭлементФ);
		Если ТекущееПоле <> Неопределено Тогда
			Попытка
				ФормаПользователя.Элементы.Удалить(ТекущееПоле);
			Исключение
				ТекущееПоле.Видимость = Ложь;
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ПроверкаВходаВСистему(СтандартнаяОбработка, ДополнительныеПараметры) Экспорт
	Если ВходВСистему Тогда
		Сообщить("вошли в систему");
		ОбработкаОчистки();
		ПолеПриветствия = ФормаПользователя.Элементы.Добавить("ПолеПриветствия", "ПолеФормы", Неопределено);
		ПолеПриветствия.Вид = ФормаПользователя.ВидПоляФормы.ПолеНадписи;
		ПолеПриветствия.Заголовок = "Привет, " + Логин + "!";
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаОшибки(ИнформацияОбОшибке, СтандартнаяОбработка, ДополнительныеПараметры) Экспорт
	Сообщить("Шеф, усё пропало!");
	Сообщить("Информация об ошибке: " + ИнформацияОбОшибке);
КонецПроцедуры


УправляемыйИнтерфейс = Новый УправляемыйИнтерфейс();
Диалоги = УправляемыйИнтерфейс.СтандартныеДиалоги;

ФормаПользователя = УправляемыйИнтерфейс.СоздатьФорму();
ФормаПользователя.Заголовок = "Форма входа";
ФормаПользователя.Высота = 150;
ФормаПользователя.Ширина = 100;

ОписаниеОповещения = ОписанияОповещений.Создать("ПроверкаВходаВСистему", ЭтотОбъект, "Мир",
		"ОбработкаОшибки", ЭтотОбъект);


ФормаПользователя.УстановитьДействие(ЭтотОбъект, "ПриОткрытии", "ПриОткрытииФормы");
ФормаПользователя.Показать();